# KeynoteEntry Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeynoteEntry Class
Members See Also
---
Represents an entry in the keynote table, containing the key value, keynote text, and parent key (if applicable).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class KeynoteEntry : KeyBasedTreeEntry
```

Visual Basic
---
```text
Public Class KeynoteEntry _
	Inherits KeyBasedTreeEntry
```

Visual C++
---
```text
public ref class KeynoteEntry : public KeyBasedTreeEntry
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..KeyBasedTreeEntry Autodesk.Revit.DB..::..KeynoteEntry
# See Also
KeynoteEntry Members
Autodesk.Revit.DB Namespace